<?php
use yii\helpers\Html;
/* @var $this yii\web\View */

$this->title = 'English B1';
?>


<h1>Dev</h1>
<div class="row">
    <div class="col-lg-6 col-md-12 col-sm-12">
        <h1>ความเป็นมา</h1>
        บทเรียนออนไลน์ หมายถึงบทเรียนที่จัดทำขึ้นเป็นสื่อการสอน ผ่านระบบเครือข่ายอินเทอร์เน็ต
        ประกอบไปด้วยโครงสร้างหลักสูตร คำอธิบายรายวิชา หน่วยการเรียนรู้ การวางแผนการจัดการเรียนรู้ เนื้อหา แบบทดสอบ
        แบบฝึกทักษะเพื่อให้นักเรียนและผู้ที่สนใจศึกษา สามารถศึกษาค้นคว้าความรู้ ได้ด้วยตนเอง โดยออกแบบไว้
        ให้โต้ตอบกับผู้เรียนได้

        การเรียนการสอนผ่านระบบเครือข่ายอินเทอร์เน็ตในรูปแบบดังกล่าวข้างต้นนี้ ได้มีผู้จัดทำมาแล้วเป็นจำนวนมาก
        โดยอาจใช้ชื่อเรียกแตกต่างกันไป เช่น เว็บไซต์ช่วยสอน บทเรียนผ่านเครือข่ายอินเทอร์เน็ต หรืออื่นๆ
        ซึ่งล้วนแล้วแต่ตั้งอยู่บนพื้นฐาน เดียวกันคือ เป็นสื่อการสอน ประเภทเว็บไซต์ช่วยสอน
        แสดงผลผ่านระบบเครือข่ายอินเทอร์เน็ต ขึ้นอยู่กับผู้จัดทำจะพัฒนาไปในรูปแบบใด
    </div>
    <div class="col-lg-6 col-md-12 col-sm-12">
        <?=Html::img('@web/img/event.jpg',[  'style'=>'width: 100%;']);?>
        <br>
        <br>
        <br>
        <br>
    </div>
    </div>
